---
kind: method
id: M:Autodesk.Revit.DB.Structure.RebarHandlesData.GetEndHandle
source: html/2ba96e6f-9840-7c2b-e7a2-2fbe99f1973a.htm
---
# Autodesk.Revit.DB.Structure.RebarHandlesData.GetEndHandle Method

Gets the end handle tag.

## Syntax (C#)
```csharp
public int GetEndHandle()
```

## Returns
Returns the end handle tag.